##Απαιτήσεις
 Στην Εποχή της Πληροφορίας το φαινόμενο [Υπερφόρτωση Πληροφορίας] (https://en.wikipedia.org/wiki/Information_overload) έχει πια εξαπλωθεί. Ο κοινωνιολόγος Georg Simmel, υπέθεσε πως η υπερφόρτωση στις αισθήσεις στο σύγχρονο αστικό κόσμο θα καταστήσει τους κατοίκους της πόλης κατάκοπους και θα συγκρουστεί με την ικανότητά τους να αντιδρούν σε νέες καταστάσεις.
 Η εφαρμογή αυτή έχει σκοπό να οργανώσει όσο το δυνατό γίνεται το πλήθος της πληροφορίας με τρόπο που ο χρήστης να επισκοπεί τη ροή της πληροφορίας πιο εύκολα, και να αποθηκεύσει αυτά που τον ενδιαφέρουν.
 
### Συλλέκτης Ροών (Rss Aggregator)
Η ανάγκη επισκόπησης πληροφοριών από διαφορετικούς ιστιοτόπους που ενδιαφέρουν το χρήστη μπορεί να ικανοποιηθεί με τη δημιουργία ενός Συλλέκτη Ροών. Η εφαρμογή  θα έχει τη δυνατότητα να παρουσίαζει ροές από διάδορες ιστοσελίδες οι οποίες παρέχουν τη πληροφορία τους σε μορφή rss.

### Σελιδοδείκτες (Bookmarks)
Καθημερινώς περνούν από την αντίληψη μας πλήθος πληροφοριών τις οποίες κρίνουμε χρήσιμες αλλά δεν έχουμε το χρόνο να τις επεξεργαστούμε. Επίσης σε αρκετές περιπτώσεις χρειαζόμαστε να ανατρέξουμε σε ένα σύνδεσμο που θυμόμαστε ότι διαβάσαμε κάπου, κάποτε αλλά δυσκολευόμαστε να το βρούμε. Η ανάγκη αποθήκευσης υπερσυνδέσμων για γρήγορη εύρεση τους μπορεί να ικανοποιηθεί μέσω λειτουργίας της εφαρμογής ν' αποθηκεύει υπερσυνδέσμους.

### Δέσμες (Bundles)
   Οι συνδέσμοι που επισκοπούνται καθημερινώς σε μια ροής δεδομένων η μια κάτω από την άλλη πολλές φορές δεν έχουν κάποια σχέση μεταξύ τους. Αυτό μπορεί να προκαλεί σύγχηση στο χρήστη. Όπως διατυπώνεται και στην ιδέα του George Miller ο ανθρώπινος εγκέφαλος έχει την ιδιότητα να επεξεργάζεται 7 "chunks" πληροφορίας +-2. Η ανάγκη για παρουσίαση των πληροφοριών ταξινομημένα λύνεται με τη δημιουργία δεσμών, όπου ο χρήστης μπορεί να βλέπει τους υπερσυνδέσμους ανα δέσμες βάση κριτηρίων που τα ορίζει ο ίδιος.
