#language: el
Λειτουργία: εγγραφή χρήστη μέσω twitter
  
  Επειδή μου φαίνεται βαρετό να κάνω λογαριασμό και να θυμάμαι άλλο κωδικό και σε αυτή την εφαρμογή, ως φίλος της εφαρμογής και χρήστης του twitter, προτείνω τη δυνατότητα εγγραφής στην εφαρμογή μέσω του λογαριασμού μου στο twitter
  
  Υπόβαθρο:
    Δεδομένου ότι επισκέπτομαι την εφαρμογή ως Eπισκέπτης
    Και εμφανίζεται το εικονίδιο για εγγραφή μέσω twitter
    
  Σενάριο: επιτυχημένη είσοδος
    Όταν ζητώ να να συνδεθώ μέσω του λογαριασμού μου στο twitter
    Και το twitter με αναγνωρίζει
    Τότε να εμφανίζεται ότι είμαι συνδεδεμένος;
