#language: el
Λειτουργία: Εισαγωγή, Επεξεργασία. Επισκόπηση και εύρεση Σελιδοδεικτών

  Υπόβαθρο: Ο χρήστης είναι συνδεδεμένος

  Σενάριο: Εισαγωγή σελιδοδείκτη
    Δεδομένου ότι ο χρήστης προσθέτει ένα σύνδεσμο στο πεδίο της φόρμας εισαγωγή συνδέσμου
    Και ο σελιδοδείκτης είναι έγκυρος
    Τότε να εμφανίζεται η φόρμα για εισαγωγή στοιχείων του σελιδοδείκτη
    Και θα πρέπει να ενεργοποιείται το κουμπί 'Αποθήκευση' της φόρμας εισαγωγή συνδέσμου
   
  # Mockup https://owncloud.ucyclubs.co/~ucyclubs/owncloud/public.php?service=files&t=5dc38f24201f8ca3c7441559e7ef1c47
  Σενάριο: Εισαγωγή στοιχείων σελιδοδείκτη
    Δεδομένου ότι εμφανίζεται η φόρμα για εισαγωγή στοιχείων σελιδοδείκτη 
    Τότε να προτείνονται στο χρήστη ετικέτες για το σύνδεσμο
    Και να προτείνεται μια μικρή περιγραφή
    
  Σενάριο: Αποθήκευση σελιδοδείκτη
    Δεδομένου ότι έχει πατηθεί το κουμπί αποθήκευσης σελιδοδείκτη
    Και οι ετικέτες είναι έγκυρες
    Και η περιγραφή είναι έγκυρη
    Τότε ο σελιδοδείκτης να αποθηκευτεί στο σύστημα
