#language: el
Λειτουργία: εισόδου ως χρήστης στην εφαρμογή  

Υπόβαθρο:
  Δεδομένου ότι επίσκεπτομαι την εφαρμογή ως Eπισκέπτης
  Και έχω λογαριασμό με όνομα χρήστη "alan" και κωδικό "enigma" 
  * ζητώ να εισέλθω στην εφαρμογή
  * μου εμφανίζεται η φόρμα για είσοδο στην εφαρμογή
  Και δίνω το ψευδώνυμο "alan" και τον κωδικό "enigma"
  
Σενάριο: εισόδου χρήστη
  Όταν ζητήσω να συνδεθώ
  Τότε να εισέρχομαι στην εφαρμογή ως "alan"
  
Σενάριο: απομνημόνευσης χρήστη στο φυλλομετρητή
  Όταν διαλέξω την επιλογή μη με ξεχάσεις
  Και ζητήσω να συνδεθώ
  Τότε να εισέρχομαι στην εφαρμογή ως "alan"
  Και μετά από επανεκκίνηση του φυλλομετρητή να παραμείνω συνδεδεμένος ως alan
