#language: el
Λειτουργία: Εισαγωγή, Επεξεργασία. Επισκόπηση και εύρεση Σελιδοδεικτών

  Mockup για φόρμα εισαγωγής στοιχείων σελιδοδείκτη:
  https://owncloud.ucyclubs.co/~ucyclubs/owncloud/public.php?service=files&t=5dc38f24201f8ca3c7441559e7ef1c47
  
  Υπόβαθρο: Ο χρήστης είναι συνδεδεμένος

  Σενάριο: Εισαγωγή σελιδοδείκτη
    Δεδομένου ότι ο χρήστης προσθέτει ένα σύνδεσμο στο πεδίο της φόρμας εισαγωγή συνδέσμου
    Και ο σελιδοδείκτης είναι έγκυρος
    Τότε να εμφανίζεται η φόρμα για εισαγωγή στοιχείων του σελιδοδείκτη
    Και θα πρέπει να ενεργοποιείται το κουμπί 'Αποθήκευση' της φόρμας εισαγωγή συνδέσμου
    
  Σενάριο: Εισαγωγή στοιχείων σελιδοδείκτη
    Δεδομένου ότι εμφανίζεται η φόρμα για εισαγωγή στοιχείων σελιδοδείκτη 
    Τότε να προτείνονται στο χρήστη ετικέτες για το σύνδεσμο
    Και να προτείνεται μια μικρή περιγραφή
    
  Σενάριο: Αποθήκευση σελιδοδείκτη
    Δεδομένου ότι έχει πατηθεί το κουμπί αποθήκευσης σελιδοδείκτη
    Και οι ετικέτες είναι έγκυρες
    Και η περιγραφή είναι έγκυρη
    Τότε ο σελιδοδείκτης να αποθηκευτεί στο σύστημα

  Σενάριο: Επισκόπηση σελιδοδεικτών
    Δεδομένου ότι ο χρήστης βρίσκεται στη σελίδα επισκόπησησης σελιδοδεικτών
    Και έχει τουλάχιστο ένα αποθηκευμένο σελιδοδείκτη
    Τότε θα πρέπει να βλέπει του σελιδοδείκτες που έχει αποθηκεύσει

  Σενάριο: Αναζήτηση σελιδοδεικτών
    Δεδομένου ότι ο χρήστης εισάγει στο πεδίο αναζήτησης μια λέξη
    Και αν η λέξη είναι αντιστοιχεί σε μια ετικέτα
    Όταν ο χρήστης πατήσει enter
    Τότε θα πρέπει να βλέπει τους σελιδοδείκτες που αντιστοιχούν στην ετικέτα
