#language: el
Λειτουργία: Δημιουργία και Επισκόπηση Δεσμών(Bundles)
  
  Mockup: https://owncloud.ucyclubs.co/~ucyclubs/owncloud/public.php?service=files&t=032b95dbf6b5b87267be5b3375257f81
  Edit mockup: http://whiteboardfox.com/25109-7596-5087

  Υπόβαθρο: Ο χρήστης είναι συνδεδεμένος

  Σενάριο: Δημιουργία Δέσμης
    Δεδομένου ότι ο χρήστης βλέπει τη φομα για δημιουργία δέσμης
    Και εισάγει μια συνθήκη δέσμης
    Όταν ο χρήστη βρίσκεται στη κύρια σελίδα
    Και ικανοποιούνται τα κριτήρια που έχουν οριστεί στη δέσμη
    Τότε ο χρήστης πρέπει να βλέπει ομαδοποιημένα τα άρθα σύμφωνα με τη δέσμη
    
