#language: el
Λειτουργία: εφημερίδας

  Υπόβαθρο:
    Δεδομένου ότι επισκέπτομαι την εφαρμογή ως Χρήστης
    * είμαι εγγεγραμένος στη ροή theguardian με υπερσύνδεσμο http://www.theguardian.com/uk/rss
    
  @javascript
  Σενάριο: εμφάνισης πηγής δίπλα από κάθε άρθρο
    Όταν ζητήσω να διαβάσω εφημερίδα
    Τότε δίπλα από κάθε άρθρο να εμφανίζεται η πηγή

  Σενάριο: εμφάνισης 9 άρθρων ανα σελίδα
    Όταν ζητήσω να διαβάσω εφημερίδα
    Τότε να εμφανίζονται μόνο 9 άρθρα
  
 # Σενάριο: επισκόπησης άρθρων
 #   Όταν ζητήσω να διαβάσω εφημερίδα
 #   Τότε να εμφανίζει άρθρα από τη ροή theguardian
    
    
