#language: el
Λειτουργία: εφημερίδας
  
  Σενάριο: διαβάσματος εφημερίδας
    Δεδομένου ότι εισέρχομαι στην εφαρμογή ως Χρήστης
    * είμαι εγγεγραμένος στη ροή The Guardian
    * η σελίδα theguardian.co.uk είναι συμβατή
    Και είμαι εγγεγραμένος στη ροή Philenews
    Αλλά η σελίδα philenews.com δεν είναι συμβατή
    Όταν ζητήσω να διαβάσω εφημερίδα
    Τότε σε λιγότερο από 1 δευτερόλεπτο εμφανίζεται περιεχόμενο
    * εμφανίζονται μόνο 9 άρθρα
    Και εμφανίζονται άρθρα από theguardian.co.uk 
    Αλλά δεν εμφανίζονται άρθρα από philenews.com
