#language: el
Δυνατότητα: Κύρια Σελίδα

Ως καινούργιος χρήστης,
για να μπορώ άμεσα να εγγραφώ στο σύστημα,
θέλω να έχω τη δυνατότητα εγγραφής από τη κύρια σελίδα.


  Υπόβαθρο:
    Δεδομένου ότι είμαι στη κύρια σελίδα
    

  Σενάριο: Εμφάνιση φόρμας εγγραφής στη κύρια σελίδα
    Όταν δεν είμαι συνδεδεμένος ως χρήστης
    Τότε να εμφανίζεται στη κύρια σελίδα η φόρμα εγγραφής

  Σενάριο: Σύνδεση από τη κύρια σελίδα
    Όταν δεν είμαι συνδεδεμένος ως χρήστης
    Τότε να εμφανίζεται στη κύρια σελίδα η φόρμα σύνδεσης
