#language: el
Λειτουργία: Εισαγωγή και Επισκόπηση Ροών
  
  Υπόβαθρο: Ο χρήστης είναι συνδεδεμένος

  Σενάριο: Εισαγωγή ροής που δεν έχει εισαχθεί στην εφαρμογή
    Δεδομένου ότι ο χρήστης εισάγει μια ροή RSS στη φομα εισαγωγής ροής
    Και η ροή δεν υπάρχει στο σύστημα
    Και η ροή είναι έγκυρη
    Όταν ο χρήστη πατήσει αποθήκευση
    Τότε η ροή θα πρέπει να καταχωρείται στο σύστημα
    Και να αναθέτεται στο χρήστη
    
  Σενάριο: Εισαγωγή ροής που υπάρχει στην εφαρμογή
    Δεδομένου ότι ο χρήστης εισάγει μια ροής στη φόρμα εισαγωγή ροής
    Και η ροή υπάρχει στο σύστημα
    Τότε η ροή να αναθέτεται στο χρήστη

  Σενάριο: Επισκόπηση ροών
    Δεδομένου ότι ο χρήστης βρίσκεται στη κύρια σελίδα
    Και έχει τουλάχιστο μια αποθηκευμένη ροή
    Όταν η ροή έχε καινούργια άρθρα
    Τότε τα άρθρα θα πρέπει να εμφανίζονται στη κύρια σελίδα
    Και να εμφανίζεται με το κάθε άρθρο το κουμπί Αποθήκευση και Κοινοποίηση

  Σενάριο: Αποθήκευση άρθρου από ροή
    Δεδομένου ότι ο χρήστης βρίσκεται στη κύρια σελίδα
    Και πατήσει σε κάποιο άρθρο αποθήκευση
    Τότε θα πρέπει να του εμφανίζεται η φόρμα εισαγωγής στοιχείων σελιδοδείκτη
    
