#language: el
Λειτουργία: Ανανέωση στοιχείων λογαριασμού

Υπόβαθρο:
  Δεδομένου ότι είμαι συνδεδεμένος στην εφαρμογή ως "authenticated"
  Και επιλέγω να ανανεώσω τα στοιχεία του λογαριασμού μου
  Και μου εμφανίζεται η φόρμα για ανανέωση στοιχείων

Σενάριο: Ανανέωση ηλεκτρονικού ταχυδρομείου
  Όταν αλλάξω την διεύθυνση ηλεκτρονικού ταχυδρομείου
  Και ζητήσω να αποθηκευτούν οι αλλαγές
  Τότε να εμφανιστεί μήνυμα ότι η αλλαγή έγινε με επιτυχία
  
Σενάριο: Ανανέωση κωδικού
  Όταν καταχωρήσω καινούργιο κωδικό
  Και ζητήσω να αποθηκευτούν οι αλλαγές
  Τότε να εμφανιστεί μήνυμα ότι η αλλαγή έγινε με επιτυχία

