#language: el
Λειτουργία: Πρόσβαση σε περιορισμένη λειτουργία από μη εξουσιοδοτημένο χρήστη

Για να μην μπορεί κάποιος να αλλάξει τις πληροφορίες του λογαριασμού μου
Ως χρήστης της εφαρμογή
Προτείνω να αποτρέπεται η πρόσβαση σε λειτουργίες του λογαριασμού μου από μη εξουσιοδοτημένο χρήση
  
Σενάριο: Επεξεργασία λογαριασμού από μη εξουσιοδοτημένο χρήστη
  Όταν επιλέξω να επεξεργαστώ το λογαριασμό του χρήστη "user"
  Και δεν είμαι συνδεδεμένος ως "user"
  Τότε να με ανακατευθύνει στη σελίδα για είσοδο χρήστη
  Και να μου εμφανίζει μήνυμα να συνδεθώ
