#language: el
Λειτουργία: Εμφάνιση όλων των χρηστών

Σενάριο: Εμφάνιση όλων των χρηστών ως απλός χρήστης
  Δεδομένου ότι είμαι συνδεδεμένος στην εφαρμογή ως "authenticated"
  Και επιλέγω να δω όλους του χρήστες
  Τότε να εμφανίζονται όλοι οι χρήστες

Σενάριο: Εμφάνιση όλων των χρηστών ως διαχειριστής
  Δεδομένου ότι είμαι συνδεδεμένος ως διαχειριστής
  Και επιλέγω να δω όλους του χρήστες
  Τότε να εμφανίζονται όλοι οι χρήστες
  Και να εμφανίζεται η επιλογή για διαγραφή χρήστη
  
Σενάριο: Διαγραφή χρήστη από το διαχειριστή
  Δεδομένου ότι είμαι συνδεδεμένος ως διαχειριστής
  Και είμαι στη σελίδα για εμφάνιση όλων των χρηστών
  Και ζητήσω να διαγραφεί ένας χρήστης
  Τότε να εμφανίζεται μήνυμα ότι η διαγραφή έγινε με επιτυχία
