#language: el
Λειτουργία: Είσοδος στην εφαρμογή
  
Υπόβαθρο:
  Δεδομένου ότι εισέρχομαι στην εφαρμογή ως επισκέπτης
  Και πηγαίνω να συνδεθώ ως χρήστης
  Και έχω λογαριασμό με όνομα χρήστη user και κωδικό password 
  
Σενάριο: Είσοδος Χρήστη
  Όταν καταχωρήσω στο όνομα χρήστη "authenticated" και στο κωδικό "password"
  Και ζητήσω να συνδεθώ
  Τότε να εισέρχομαι στην εφαρμογή ως "authenticated"
  
Σενάριο: Μη με ξεχάσεις
  Όταν καταχωρήσω στο όνομα χρήστη "authenticated" και στο κωδικό "password"
  Και διαλέξω την επιλογή μη με ξεχάσεις
  Και ζητήσω να συνδεθώ
  Τότε να εισέρχομαι στην εφαρμογή ως "authenticated"
  Και να μην με ξεχάσει
