#language: el
Λειτουργία: Ξέχασα το κωδικό

Για να μπορώ να μπορώ να επαναφέρω το κωδικό μου σε περίπτωση που τον ξεχάσω
Ως ξεχασιάρης χρήστης
Προτείνω τη λειτουργία Ξέχασα το κωδικό

Μέθοδος των 5 Γιατί:
Γιατί να θες να επαναφέρεις το κωδικό;
Αν μπορώ να τον επαναφέρω δεν θα σταματήσω να χρησιμοποιώ την εφαρμογή
Γιατί να πειράζει αν σταματήσεις να χρησιμοποιείς την εφαρμογή;
Αν σταματήσω να χρησιμοποιώ την εφαρμογή χάνει η εφαρμογή από την αξία της
Γιατί αν σταματήσει ένα χρήστης να χρησιμοποιεί την εφαρμογή να χάσει από την αξία της;
Λιγότεροι χρήστες, λιγότερο δημοφιλής εφαρμογή, λιγότερες προτάσεις λειτουργιών, λιγότερες δυνατότητες να πετύχει
Γιατί να θες να πετύχει;
Αν η εφαρμογή πετύχει δεν θα υποφέρουν οι άνθρωποι από το φαινόμενο υπερφόρτωσης της πληροφορίας
Γιατί να αποφεύγεται το φαινόμενο υπερφόρτωση πληροφορίας;
Έτσι ο κόσμος θα είναι πιο χαρούμενος και πιο παραγωγίκός.

Υπόβαθρο:
  Δεδομένου ότι εισέρχομαι στην εφαρμογή ως επισκέπτης
  Και πηγαίνω στη φόρμα για είσοδο στην εφαρμογή
  Και αναφέρω ότι ξέχασα το κωδικό μου
  Και μου εμφανίζεται η φόρμα για επαναφορά κωδικού
  
Σενάριο: Επαναφορά κωδικού
  Όταν καταχωρήσω την ηλεκτρονική διεύθυνση μου
  Και ζητήσω να επαναφορά του κωδικού
  Τότε να λαμβάνω ημήνυμα με υπερσύνδεσμο που θα μου δίνει επιλογή να αλλάξω τον κωδικό
